{
  "inputfile": {
	"description": 
"Loads a file for processing - supports mono and stereo .wav files

[b]Parameters[/b]
[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Load File[/cell][cell]Opens a file browser to select a sound file[/cell][cell][center]𐄂[/center][/cell]
[cell]Play/Stop[/cell][cell]Plays the input sound file[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
SoundThread only supports mono and stereo .wav files.

Clicking and dragging on the soundfile viewer will let you select a section of audio to play.

If audio is selected in Input File when you run the thread, SoundThread will automatically cut out that section and process only that.

Clicking on the soundfile viewer while audio is playing will allow you to jump around the file to listen to different sections.
",
  },
  "outputfile": {
	"description": 
"Manages output for running threads

[b]Parameters[/b]
[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]File Name[/cell][cell]The name for your output file[/cell][cell][center]𐄂[/center][/cell]
[cell]Run Thread[/cell][cell]Runs the current thread, opens a file dialog to choose the folder for the output files[/cell][cell][center]𐄂[/center][/cell]
[cell]Delete Intermediate Files[/cell][cell]If switched on, deletes all files except the final output file[/cell][cell][center]𐄂[/center][/cell]
[cell]Reuse Last Output Folder[/cell][cell]If switched on, the last folder selected on Run Thread will be used for output files[/cell][cell][center]𐄂[/center][/cell]
[cell]Open Folder[/cell][cell]Opens the last used output folder[/cell][cell][center]𐄂[/center][/cell]
[cell]Recycle File[/cell][cell]Loops the output file back to the Input File node for reprocessing[/cell][cell][center]𐄂[/center][/cell]
[cell]Play/Stop[/cell][cell]Plays the last output file[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
The name inputted in File Name will be appended with the current date and time so that you don't need to input a new file name each time.

SoundThread can create a lot of files as each node in the thread can create multiple files. Turning on Delete Intermediate Files will delete everything but the main output file. 

Clicking and dragging on the soundfile viewer will let you select a section of audio to play. Clicking on the soundfile viewer while audio is playing will allow you to jump around the file to listen to different sections.
",
  },
  "notes": {
	"description": 
"A box for taking notes

[b]Functionality[/b]
Doesn't do anything other than giving you a space to take notes. You can right click in the text box to copy and paste and use special characters like emojis 😊.
",
  },
  "distort_average": {
	"description": 
"Average the waveshape over a number of wavecycles

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Cycle Count[/cell][cell]Number of cycles over which to average[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Performs a mathematical averaging of the set number of cycle counts. The effect is more akin to a loss of resolution than the blurring which might be expected. Values below 10 retain some semblance of the original, while values of 100 create a kind of 'sample hold' effect.

",
  },
  "clip_clip_2": {
	"description": 
"Clip a fraction of half wavecycles

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Fraction[/cell][cell]Fraction of each half wavecycle to clip, 1 = no change[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
Cuts the top and bottom off of a wavecycle. Unlike conventional clipping that only cuts off parts of the signal that exceeds a set threshold, Clip Fraction looks at each cycle of the sound and cuts off a set fraction of that wavecycle. This produces a clipping effect that is uniform across the entire signal and maintains the dynamic range of the original. The lower you set the value, the more distorted the sound will be.
",
  },
  "distort_divide": {
	"description": 
"Distortion by dividing wavecycle frequency

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Divider[/cell][cell] [/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Takes a wavecycle and divides its frequency, pitch shifting it down and making it slower. This longer wavecycle replaces the next few wavecycles keeping the length of the file the same. This produces a rough pitch shift effect with added distortion artifacts. Works best with division values less than 4, at high division values the sound file may be too low to hear.

This process is the opposite of Distort: Multiply.
",
  },
  "distort_fractal": {
	"description": 
"Superimpose miniature copies of a wavecycles onto itself

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Scaling[/cell][cell]The division of scale of the wavecycle[/cell][cell][center]✓[/center][/cell]
[cell]Loudness[/cell][cell]Loudness of fractal component compared to original wavecycle, 1 = same level.[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Takes a wavecycle and divides its length and makes shorter and higher copies that equal the divided length. It then takes these copies and superimposes them over the original wavecycle. The higher the scaling the shorter each copy will be and the more copies will be layered over the original. The loudness control works like a mix between the original and the copies of the wavecycle. Produces a sheen of distortion over the original sound.
",
  },
  "distort_interpolate": {
	"description": 
"Time-stretch by repeating wavecycles and interpolating between them

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Multiplier[/cell][cell]The number of times each wavecycle repeats[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Takes a wavecycle and repeats it based on the multiplier. On each repetition the wavecycle is morphed slightly in shape so that it morphs into the shape of the next wavecycle in the file. This adds a modulatory quality to the output, successive wavecycles gliss and bend as they flow into one another.
",
  },
  "distort_multiply": {
	"description": 
"Distortion by multiplying wavecycle frequency

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Multiplier[/cell][cell]The amount each wavecycle is multiplied by[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Takes each wavecycle and multiplies its frequency making it higher and shorter. It then repeats this wavecycle to fill the length of the original keeping the output file the same length. This produces a distorted pitching up of the sound. 

This process is the opposite of Distort: Divide.
",
  },
  "distort_reform_2": {
	"description": 
"Replaces wavecycles with square shaped wavecycles

[b]Functionality[/b]
This process reads each wavecycle and replaces it with a square waveform of the same length and amplitude. This produces a similar but considerably harsher effect to Distort: Clip Fraction.
",
  },
  "distort_reform_4": {
	"description": 
"Replaces wavecycles with triangle shaped wavecycles

[b]Functionality[/b]
This process reads each wavecycle and replaces it with a triangle waveform of the same length and amplitude. This effect of this process is quite dependent on the input material. If applied to noisy and distorted sounds this will producing a smoothing or filtering like effect. On sounds with few harmonics - e.g. sine waves - it will add additional harmonics producing a gentle distortion.
",
  },
  "distort_reform_6": {
	"description": 
"Replaces wavecycles with short pulses


[b]Functionality[/b]
This process reads each wavecycle and replaces it with a short square pulse of a random length of the same amplitude. This produces a rough, rattle like timbre.
",
  },
  "distort_replace": {
	"description": 
"The strongest wavecycle in a group replaces the others

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Cycle Count[/cell][cell]The size of the group[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Looks at a set number of wavecycles and finds the loudest one and repeats it to replace all other wavecycles. The repeated wavecycle is repeated at its original frequency and amplitude. This produces a sample and hold like effect.
",
  },
 	"quirk_quirk_1": {
	"description": 
"Distortion by raising sample values of half wavecycles to a power

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Power Factor[/cell][cell]The power to raise each sample to[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
Introduces distortion into a signal by raising sample values to a power. Values less than 1 tend to flatten the tops of the waveform, while values greater than 1 narrow the waveform shape, creating a thinner, raspier sound.
",
  },
 	"extend_drunk_1": {
	"description": 
"Wanders through a soundfile jumping forwards and backwards while repeating small segments

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Minimum Output Duration[/cell][cell]The minimum length of the output in seconds[/cell][cell][center]𐄂[/center][/cell]
[cell]Location[/cell][cell]The position in percent of the input file where the drunken walk occurs[/cell][cell][center]𐄂[/center][/cell]
[cell]Ambitus[/cell][cell]The percentage of the input file the walk can move either side of the location by over the whole process[/cell][cell][center]𐄂[/center][/cell]
[cell]Maximum Step[/cell][cell]The maximum percentage of the input file the walk can move by on each step[/cell][cell][center]𐄂[/center][/cell]
[cell]Clock[/cell][cell]The time between each step in seconds[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
Starting at the Location in the input file this process takes a segment and repeats it. When the next clock tick occurs the process will step to another segment and start repeating that. The distance in the file that each step can be is set by the Maximum Step and the amount of the file that it is possible for the process to explore either side of the original Location is set by the Ambitus. 
",
  },
 	"extend_loop_1": {
	"description": 
"Repeats advancing segments of a sound

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Start[/cell][cell]The position in percent of the input file where the process will begin[/cell][cell][center]𐄂[/center][/cell]
[cell]Loop Length[/cell][cell]The length of each looping segment in milliseconds[/cell][cell][center]𐄂[/center][/cell]
[cell]Step[/cell][cell]The percentage of the input file it moves forwards by on each loop[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
Joins together, end-to-end, a series of segments taken from the file. This process will continue until the end of the file is reached. Note, with very long loop lengths and very short steps this may make [b]very[/b] long files.
",
  },
 	"extend_scramble_1": {
	"description": 
"Scrambles a soundfile for a set duration

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Minimum Chunk Length[/cell][cell]Minimum percentage of the input to cut[/cell][cell][center]𐄂[/center][/cell]
[cell]Maximum Chunk Length[/cell][cell]Maximum percentage of the input to cut[/cell][cell][center]𐄂[/center][/cell]
[cell]Output Duration[/cell][cell]Length of the output file in seconds[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
Cuts out segments at random from the full duration of the file and splices them end to end. Randomises the length of each chunk to be between the minimum and maximum. With small maximum chunks this will produce a granular synthesis like effect, with large chunks it will create new phrases in the material.
",
  },
 	"extend_zigzag_1": {
	"description": 
"Moves through a sound sliding backwards and forwards as it goes

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Start Point[/cell][cell]The point in percent of the input where the process begins[/cell][cell][center]𐄂[/center][/cell]
[cell]End Point[/cell][cell]The point in percent of the input where the process ends[/cell][cell][center]𐄂[/center][/cell]
[cell]Output Duration[/cell][cell]The total duration of the output file[/cell][cell][center]𐄂[/center][/cell]
[cell]Minimum Zigzag Time[/cell][cell]Minimum acceptable time between successive zigzag timepoints[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
Unlike the other extend processes this process also plays segments of the sound file backwards. This results in a smoother transition between jumps creating an output that slips and slides through its length.
",
  },
 	"filter_bank_1": {
	"description": 
"Bank of filters tuned to the harmonic series

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Q[/cell][cell]How narrow each filter band is[/cell][cell][center]✓[/center][/cell]
[cell]Makeup Gain[/cell][cell]How much gain to apply after filtering[/cell][cell][center]𐄂[/center][/cell]
[cell]Lowest Band[/cell][cell]The lowest band in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Highest Band[/cell][cell]The highest band in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Scatter[/cell][cell]Amount of deviation from the harmonic series[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
This process takes the frequency of the lowest band and create filters up to the value of the highest band tuned to the harmonic series. Scatter applies some randomisation of these values moving the sound from something very harmonic to something more bell like in tone. The makeup gain provides a way of adding a boost to the filtered signal, you may need to adjust this if clipping occurs. Note, Q can be automated although doing this does sometimes produce temperamental results.
",
  },
 	"filter_bank_2": {
	"description": 
"Bank of filters tuned to odd harmonics from the harmonic series

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Q[/cell][cell]How narrow each filter band is[/cell][cell][center]✓[/center][/cell]
[cell]Makeup Gain[/cell][cell]How much gain to apply after filtering[/cell][cell][center]𐄂[/center][/cell]
[cell]Lowest Band[/cell][cell]The lowest band in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Highest Band[/cell][cell]The highest band in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Scatter[/cell][cell]Amount of deviation from the harmonic series[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
This process takes the frequency of the lowest band and create filters up to the value of the highest band tuned to odd harmonics of the harmonic series. Scatter applies some randomisation of these values moving the sound from something very harmonic to something more bell like in tone. The makeup gain provides a way of adding a boost to the filtered signal, you may need to adjust this if clipping occurs. Note, Q can be automated although doing this does sometimes produce temperamental results.
",
  },
 	"filter_bank_5": {
	"description": 
"Bank of filters with a fixed number of bands spaced linearly between two frequencies

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Q[/cell][cell]How narrow each filter band is[/cell][cell][center]✓[/center][/cell]
[cell]Makeup Gain[/cell][cell]How much gain to apply after filtering[/cell][cell][center]𐄂[/center][/cell]
[cell]Lowest Band[/cell][cell]The lowest band in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Highest Band[/cell][cell]The highest band in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Number of Filters[/cell][cell]The number of bands in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Scatter[/cell][cell]Amount of deviation from the harmonic series[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
This process takes the number of filters and spaces them equally in Hz between the lowest and highest bands. Scatter applies some randomisation of these values. The makeup gain provides a way of adding a boost to the filtered signal, you may need to adjust this if clipping occurs. Note, Q can be automated although doing this does sometimes produce temperamental results. Unlike Filter Bank: Pitched Intervals this will produce a more discordant sound as the frequencies will not align to uniform harmonic intervals.
",
  },
 	"filter_bank_6": {
	"description": 
"Bank of filters with a fixed number of bands spaced musically between two frequencies

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Q[/cell][cell]How narrow each filter band is[/cell][cell][center]✓[/center][/cell]
[cell]Makeup Gain[/cell][cell]How much gain to apply after filtering[/cell][cell][center]𐄂[/center][/cell]
[cell]Lowest Band[/cell][cell]The lowest band in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Highest Band[/cell][cell]The highest band in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Number of Filters[/cell][cell]The number of bands in the bank[/cell][cell][center]𐄂[/center][/cell]
[cell]Scatter[/cell][cell]Amount of deviation from the harmonic series[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
This process takes the number of filters and spaces them equally in semitones between the lowest and highest bands. Scatter applies some randomisation of these values moving the sound from something very harmonic to something more bell like in tone. The makeup gain provides a way of adding a boost to the filtered signal, you may need to adjust this if clipping occurs. Note, Q can be automated although doing this does sometimes produce temperamental results. Unlike Filter Bank: Linear this will produce a more consonant sound as the frequencies will align to uniform harmonic intervals.
",
  },
 	"filter_lohi_1": {
	"description": 
"Fixed low-pass or high-pass filter

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Rolloff[/cell][cell]Gain reduction of the filter, in dB[/cell][cell][center]𐄂[/center][/cell]
[cell]Pass-band[/cell][cell]Last pitch to be passed by the filter in Hz[/cell][cell][center]𐄂[/center][/cell]
[cell]Stop-band[/cell][cell]first pitch to be stopped by the filter in Hz[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
The low-pass filter lets through all of the sound below pass-band and attenuates the frequencies higher than pass-band, ending at stop-band.

The high-pass filter lets through all of the sound above pass-band and attenuates the frequencies lower than pass-band, ending at stop-band.

Setting the Pass-band lower than the stop-band creates a low-pass filter. Setting the Pass-band higher than the stop-band creates a high-pass filter.
",
  },
 	"modify_brassage_1": {
	"description": 
"Granular pitch shift keeping the same speed

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Pitch Shift[/cell][cell]Amount in semitones to shift the pitch by[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Cuts the sound file into grains and speeds them up or slows them down to change their pitch. By repeating/omitting grains it retains the original speed. At high increases in pitch this will create a metalic sound, with high decreases in pitch the sound will lose detail.
",
  },
 	"modify_brassage_2": {
	"description": 
"Granular time stretch keeping the same pitch

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Speed[/cell][cell]Multiplier to increase/decrease the speed by, 1 = original speed, 2 = double speed, 0.5 = half speed[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Cuts the sound file into grains and repeats omits grains to adjust the speed of the sound. At high decreases in speed this will create a metalic sound, with high increases in speed the sound will lose detail.
",
  },
 	"modify_brassage_4": {
	"description": 
"Random reordering of grains

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Grainsize[/cell][cell]Size of the grains in milliseconds[/cell][cell][center]✓[/center][/cell]
[cell]Range[/cell][cell]Distance to move while looking for next grain[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Moves through the file from start to end and reorders the grains within the set timeframe of range. Small range values will retain some of the original shape of the sound, large range values will result in a very jumbled sound.
",
  },
 	"modify_brassage_5": {
	"description": 
"Puts a grainy surface on a source

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Density[/cell][cell]Amount of grain overlap[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Moves through the sound from start to end and cuts it into grains. The density control sets how many of these grains are played back. A density of 1 will sound close to the original file, less than 1 will introduce gaps between grains, and values greater than one will smooth out the sound and introduce doubling.
",
  },
 	"modify_brassage_6": {
	"description": 
"Powerful granular segmentation/fragmentation procedures

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Scan Speed[/cell][cell]How fast to move through the file, 1 = original speed, 2 = double speed, 0.5 = half speed[/cell][cell][center]✓[/center][/cell]
[cell]Density[/cell][cell]Amount of grain overlap, values less than 1 create gaps[/cell][cell][center]✓[/center][/cell]
[cell]Grain Size[/cell][cell]Length of grains in ms[/cell][cell][center]✓[/center][/cell]
[cell]Pitch Shift[/cell][cell]Amount to shift pitch of grain in semitones[/cell][cell][center]✓[/center][/cell]
[cell]Amplitude[/cell][cell]Overal amplitude of the output[/cell][cell][center]✓[/center][/cell]
[cell]Panning[/cell][cell]Panning of grains from left to right[/cell][cell][center]✓[/center][/cell]
[cell]Attack[/cell][cell]Amount of time in ms each grain takes to fade in[/cell][cell][center]✓[/center][/cell]
[cell]Decay[/cell][cell]Amount of time in ms each grain takes to fade out[/cell][cell][center]✓[/center][/cell]
[cell]Search Range[/cell][cell]Distance to move while looking for next grain[/cell][cell][center]✓[/center][/cell]
[cell]Jitter[/cell][cell]Amount of randomisation of grain position[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
This process moves through the file from start to end at the speed set by scan speed. How linearly it moves through the file is set by the Search Range and Jitter. 

As it moves through the file it cuts out small chunks - called grains - of the file and plays those back. The length of those grains and how they fade in and out is set by the Grain Size, Attack and Decay. The pitch of the grains is set by Pitch Shift. 

How many grains play back is set by the Density, desities less than 1 will create gaps between grains, densities higher than 1 will cause grains to overlap and merge. 

Finally the sound can be panned from left to right with Panning and the overall level of the sound can be adjusted with Amplitude. 

This process works particularly well when automation is applied to many parameters to make it shift and change over time. 
",
  },
 	"modify_loudness_1": {
	"description": 
"Adjust gain

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Gain[/cell][cell]The amount to scale the signal by[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Adjusts the gain of a sound making it louder and quieter. Less than 1 is quieter, more than 1 is louder. Useful for adjusting the level of a sound before a process to avoid clipping and for blending parallel processing in your thread (see Help > Tips > Wet/Dry Mix for more). 
",
  },
 	"modify_radical_1": {
	"description": 
"Reverses a sound

[b]Functionality[/b]
Makes the sound play backwards. Particularly useful before processes like Stack to create interesting attack and decays.
",
  },
 	"modify_speed_2": {
	"description": 
"Speeds up or slows down a sound changing pitch

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Semitones[/cell][cell]The amount to adjust the speed/pitch by in semitones[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Plays the sound faster or slower to adjust its speed and pitch. -12 semitones is half speed, +12 semitones is double speed. 
",
  }, 
 	"modify_speed_5": {
	"description": 
"Speed up or slow down a sound over time

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Transposition Ratio[/cell][cell]The amount to adjust the speed by as a multiplier[/cell][cell][center]𐄂[/center][/cell]
[cell]Goal Time[/cell][cell]The point in the input sound in percent to have reached the transposition ratio by[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
Creates a glissando effect by gradually speeding up or slowing down the file. Once the target time in the sound is reached it will continue sliding up or down to the end of the sound. 0.5 = half speed and 1 octave lower, 2 = double speed and 1 octave higher. Note: for more control over speed over time you can automate the Speed process instead. 
",
  },
 	"modify_stack": {
	"description": 
"Stacks transposed versions of a sound on top of one another

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Transposition[/cell][cell]The amount in semitones each layer is transposed by[/cell][cell][center]𐄂[/center][/cell]
[cell]Layers[/cell][cell]The number of layers[/cell][cell][center]𐄂[/center][/cell]
[cell]Lean[/cell][cell]The loudness of the highest layer relative to the others[/cell][cell][center]𐄂[/center][/cell]
[cell]Attack Offset[/cell][cell]The point in the file in percent where the attack of the sound begins[/cell][cell][center]𐄂[/center][/cell]
[cell]Output Gain[/cell][cell]Adjusts the output gain to avoid clipping[/cell][cell][center]𐄂[/center][/cell]
[cell]Output Duration[/cell][cell]The amount of the sound to render, 1 is the full sound[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
This process takes the sound and makes numerous copies of it, set by the number of layers. Each copy is sped up or slowed down by the transposition amount mulitplied by its layer number - -12 semitones = half speec, +12 semitones = double speed. These layers are then stacks on top of each other to create a denser sound. The attack offset is used to line up the layers so that their attacks all line up, adjust this to the point in the input where you want all the sounds to line up. The output duration allows you to trim off the end of the sound as with negative transposition and many layers the output can get very long. 
",
  },
 	"blur_blur": {
	"description": 
"Time-average the spectrum

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Bluring[/cell][cell]The number of windows over which to average the spectrum[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
This process 'blurs' detail in the time dimension by interpolating between the spectral envelope values of the start and end windows blurring windows. Note that it is not interpolating continuously over all the windows inbetween, just between the data in the start and end windows. The overall result is somewhat affected by just how different the data is in these two windows. The interpolation process produces a 'straight line' (linear) scale of values between the start and end points.
",
  },
 	"blur_chorus_5": {
	"description": 
"Chorusing by randomising amplitudes and frequencies of partials

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Amplitude Randomise[/cell][cell]Maximum random scatter of partial amplitudes[/cell][cell][center]✓[/center][/cell]
[cell]Frequency Randomise[/cell][cell]Maximum random scatter of partial frequencies[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
This process attempts to achieve a chorusing effect by randomising the amplitude and frequency values of the partials. If very large amplitude aspread values are used, the sound will turn to noise. The chorusing effect itself is achieved by values just a little above 1. Values of 2 or 3 begin to create a granular effect, and values of 10, 100 and 1000 create more and more noise.
",
  },
 	"blur_scatter": {
	"description": 
"Randomly thin the spectrum

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Amount Kept[/cell][cell]Number of randomly chosen blocks to keep in each spectral window[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
This function throws away a specified proportion of the analysis data in each window at random. This produces a result similar to the Trace process however, unlike Trace the material kept by Thin Randomly may or may not include prominent parts of the sound.
",
  },
 	"focus_accu": {
	"description": 
"Sustain each spectral band until louder data appears in that band

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Decay[/cell][cell]Ammount for each sustained band to decay each second[/cell][cell][center]✓[/center][/cell]
[cell]Glissandos[/cell][cell]Amount each sustained band glissandos in octaves per second[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Frequencies are sustained into subsequent windows. The overall effect is one of sustaining, but one which also makes the spectrum more complex.

The Glissandos parameter produces glissandos within the spectrum of the sound. Very effective slow glissandos are produced when gliss is near 0, e.g., -0.9 or 0.1. At 0.5, there are several glissandos, at 1, they are fairly fast, and at 10 it becomes a wash.
",
  },
 	"hilite_trace_1": {
	"description": 
"Highlight the loudest partials

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Amount Kept[/cell][cell]The number of partials to keep[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
Looks for and retains only the N loudest partials in the analysis data on a window-by-window basis. This reduces the data in the spectral dimension and produces an aural 'trace' of the original sound.

With non-'noisy' sources it is necessary to reduce the number of channels quite considerably to make any appreciable aural change to the source sound. Even the 10 loudest channels will retain a surprising amount of the original sound. The flip-side of this is that HILITE TRACE can be used to 'clean' a sound, if a certain amount of data loss is not a problem. 

This works well with Blur after it to create a smeared simplified version of the sound.
",
  },
 	"pvoc_anal_1": {
	"description": 
"Convert a sound from the time domain to the frequency domain

[b]Functionality[/b]
This is process is used to analyse and a sound and convert it from the time domain to the frequency domain. This allows for processes in the PVOC processes menu to be used to manipulate the sound. Once you are done processing in the frequency domain you can convert it back to audio again using Resynthesise. See Help > Tutorials > PVOC for more.
",
  },
 	"pvoc_synth": {
	"description": 
"Convert a sound from the frequency domain to the time domain

[b]Functionality[/b]
This is process is used to take the analysis of a sound file and resynthesise it back into the time domain. This should be used after you are done processing in the frequency domain to convert back to audio. See Help > Tutorials > PVOC for more. 
",
  },
 	"spec_gain": {
	"description": 
"Adjusts the gain in the frequency domain

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Gain[/cell][cell]The amount to scale the gain by[/cell][cell][center]✓[/center][/cell]
[/table]

[b]Functionality[/b]
This process is very similar to the time domain Gain process, it adjusts how loud the signal is, however this process operates on signals that are in the frequency domain. This is useful for adjusting signals that may clip when converted back to the time domain.
",
  },
 	"spectstr_stretch": {
	"description": 
"Time-stretch a sound without changing pitch

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Stretch Multiplier[/cell][cell]The amount to stretch the sound by[/cell][cell][center]𐄂[/center][/cell]
[cell]D-Ratio[/cell][cell]Proportion of channels to discohere[/cell][cell][center]𐄂[/center][/cell]
[cell]D-Random[/cell][cell]Frequency randomisation of discohered channels[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
Stretches or shrinks the sound over time, without changing frequency. It creates extra time-windows to expand the overall time-base of the sound, without a change of frequency. When using large stretch values you will make very long sound files and this process may take some time to run.

D-Ratio and D-Random allow you to randomise some of the channels in the sound to create internal variation and different timbres. Small amounts of this will blur the sound slightly and on long stretches help the sound feel less static. With large amounts of randomisation the texture of the sound starts to feel granular.
",
  },
 	"strange_invert_1": {
	"description": 
"Invert the spectral envelope

[b]Functionality[/b]
Inverts the spectral envelope, relative to the overall spectral envelope. This means that the energy asociated with the highest frequency bands is transferred to the lowest ones and vice versa. As the lowest partials in many sounds have the greatest amplitude and the highest ones the least, the result is typically a much brighter timbre.
",
  },
 	"strange_waver_1": {
	"description": 
"Oscillate between harmonic and inharmonic state

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell]Vibrato Frequency[/cell][cell]Speed of oscillations in Hz[/cell][cell][center]✓[/center][/cell]
[cell]Stretch[/cell][cell]The maximum spectral stretch in the inharmonic state[/cell][cell][center]✓[/center][/cell]
[cell]Base Frequency[/cell][cell]The frequency above which spectral stretching happens[/cell][cell][center]𐄂[/center][/cell]
[/table]

[b]Functionality[/b]
Introduces an oscillation towards and away from inharmonicness in the spectrum of a sound. The program moves towards inharmonicness by means of the stretch factor. 
",
  },
 	"processname": {
	"description": 
"Short Description

[table=3]
[cell][b]Parameter Name[/b][/cell][cell][b]Description[/b][/cell][cell][b]Automatable[/b][/cell]
[cell] [/cell][cell] [/cell][cell][center]✓𐄂[/center][/cell]
[/table]

[b]Functionality[/b]

",
  },
}
